## Staging: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.blazer_exection_role_parameter_policy will be created
  + resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "blazer_exection_role_parameter_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          + "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.blazer_exection_role_parameter_policy_actions will be created
  + resource "aws_iam_role_policy_attachment" "blazer_exection_role_parameter_policy_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blazer_execution_role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>